ChuckM/stm32f4-uart-driver/uart.c
/*
 * This is a small hack which takes function keys (arrow keys, etc)
 * and returns a 'character' for them. It waits briefly to (2mS) to see
 * if another character is going to follow an ESC and if it does then
 * it trys to collect the entire escape sequence which can be translated
 * into a function key (or special key).
 */
static uint8_t fkey_buf[5];
static int fkey_ndx;

static uint8_t map_function_key(void);

/*
 * Ok, if we got a function key sequence we look here to map it
 * into an 8 bit return value. It was simply $[<char> we take the
 * character returned and turn on bit 7.
 */
static uint8_t
map_function_key(void) {
    if (fkey_ndx == 1) {
        return 0x80 | fkey_buf[1];
    }
    return 0xff;
}

/* --- "high" level APIs (channel based) ---
 *
 * uart_getc(channel, wait)
 *
 * If wait is non-zero the function blocks until a character
 * is available. If wait is 0 then the function returns immediately
 * with '0' as the value. (yes this means it can't read 'nul' bytes
 * interactively)
 */
char
uart_getc(int channel, int wait) {
    char res;

    if ((cur_recv_ndx[channel] == nxt_recv_ndx[channel]) && ! wait) {
        return '\000';
    }
    while (cur_recv_ndx[channel] == nxt_recv_ndx[channel]) {
        __asm__("NOP");
    }
    res = recv_buf[channel][cur_recv_ndx[channel]];
    cur_recv_ndx[channel] = (cur_recv_ndx[channel] + 1) % UART_BUF_SIZE;
    /* check for function key */
    /* as written this code depends on the function key
     * string coming in at full speed and there being a
     * slight delay with the next character, but that might
     * not be a good assumption. We'll see if it is good enough
     * for now.
     *
     * In testing 2 mS sleeps to be sure another character isn't
     * coming in seems to be ok, also you don't normally type the CSI
     * sequence (^[ [) on your own. you can "fool" the input driver
     * if you do into trying to interpret a function key sequence with
     * unpredictable results.
     */
    fkey_ndx = 0;
    if (res == 27) {
        msleep(2);
        if ((cur_recv_ndx[channel] != nxt_recv_ndx[channel]) &&
            (recv_buf[channel][cur_recv_ndx[channel]] == 91)) {
            for (fkey_ndx = 0; fkey_ndx < 5; fkey_ndx++) {
                fkey_buf[fkey_ndx] = recv_buf[channel][cur_recv_ndx[channel]];
                cur_recv_ndx[channel] = (cur_recv_ndx[channel] + 1) %
                                                            UART_BUF_SIZE;
                msleep(2);
                if (cur_recv_ndx[channel] == nxt_recv_ndx[channel]) {
                    break; // no more characters
                }
            }
        }
    }
    return (fkey_ndx == 0) ? res : map_function_key();
}

/*
 * char *uart_gets()
 *
 * This is the 'old school' getstring function. It allows for basic
 * editng (delete or backspace) and returns on the receipt of <CR>.
 * It null terminates the string as it builds it and returns if it
 * runs out of space, it also returns if the <CR> is typed, and sends
 * ^G (BELL) if the input tries to delete before the start of the
 * buffer.
 */
char *
uart_gets(int chan, char *buf, int len) {
    char *line_buf = buf;
    char c;

    *line_buf = '\000';
    // read until you see a <CR>
    while (1) {
        c = uart_getc(chan, 1);
        if (c == '\r') {
            uart_putc(chan, '\r');
            uart_putc(chan, '\n');
            break;
        }
        // if you see a ^H or ^? (<DEL>) delete last character
        if ((c == '\010') || (c == '\177')) {
            if (line_buf > buf) {
                uart_puts(chan, "\010 \010"); // back up one space
                if (line_buf > buf) {
                    line_buf--;
                }
                *line_buf = '\000';
            } else {
                uart_putc(chan, '\a');  // beep the console
            }
        } else {
            uart_putc(chan, c);
            *line_buf = c;
            line_buf++;
            // if you're at the end of the buffer just return
            if (line_buf < (buf + len)) {
                *line_buf = '\000';
            } else {
                --line_buf;
                *line_buf = '\000';
                break;
            }
        }
    }
    return buf;
}

/*
 * uart_putc
 *
 * This pushes a character into the transmit buffer for
 * the channel and turns on TX interrupts (which will fire
 * because initially the register will be empty.) If the
 * ISR sends out the last character it turns off the transmit
 * interrupt flag, so that it won't keep firing on an empty
 * transmit buffer.
 */
void
uart_putc(int chan, char c) {
    uint32_t usart = channel_to_uart_map[chan];

    /* block if the transmit buffer is full */
    while (((nxt_xmit_ndx[chan] + 1) % UART_BUF_SIZE) == cur_xmit_ndx[chan]) {
        __asm__("NOP");
    }
    xmit_buf[chan][nxt_xmit_ndx[chan]] = c;
    nxt_xmit_ndx[chan] = (nxt_xmit_ndx[chan] + 1) % UART_BUF_SIZE;
    usart_enable_tx_interrupt(usart);
}

/*
 * uart_puts(char *string)
 *
 * Write a NUL terminated string to the UART. This routine writes
 * the characters in order (adding LF to CR). Note that line cleanup
 * is done here and not in putc so that you can send just \r or what
 * ever you want through putc without worrying about it.
 */
void
uart_puts(int chan, const char *s) {
    if (s == NULL)
        return;

    while (*s) {
        if (*s == '\n') {
            uart_putc(chan, '\r');
        }
        uart_putc(chan, *s++);
    }
}

/*
 * UART Pin Mapping
 *
 * To faciliate a very flexible USART/UART configuration utility
 * I needed a way to encode the relationship of various pins to
 * their USART registers, there GPIO pins, the various AHB and APB
 * registers. There are probably a zillion ways to do this but I
 * chose to create code which has embedded in it the notion of what
 * goes where. So that I could query it with a simple API.
 *
 * The function uart_pin_map takes a UART_PORT_PIN and can return
 * information about it like which GPIO it needes enabled, what flag
 * in the APB register it needs on, etc. It does not care if you use
 * the TX pin out of one GPIO port and the RX pin out of another.
 *
 * The only ambiguity is UART4/USART3 which share TX and RX pins
 * and differ only by their Alternate function value (7 or 8). So
 * we don't support UART4 on those pins (only USART3).
 */

