ChuckM/stm32f4-uart-driver/uart.c
/*
 * Prototypes for helper functions
 */

static uint32_t pin_to_bit(enum UART_PORT_PIN pin);
static uint32_t pin_to_enable(enum UART_PORT_PIN pin);
static uint32_t pin_uart_attr(enum UART_PORT_PIN pin, int attr);
static uint32_t pin_to_af(enum UART_PORT_PIN pin);
static uint32_t pin_to_gpio(enum UART_PORT_PIN pin);

/* A really simple one, this maps the name (like PA0) to the bit number
 * define like GPIO0.
 */
static uint32_t
pin_to_bit(enum UART_PORT_PIN pin) {
    switch (pin) {
        case PA0:
        case PE0: return GPIO0;
        case PA1:
        case PE1: return GPIO1;
        case PA2:
        case PD2: return GPIO2;
        case PA3: return GPIO3;
        case PD5: return GPIO5;
        case PB6:
        case PC6:
        case PD6:
        case PF6: return GPIO6;
        case PB7:
        case PC7:
        case PE7:
        case PF7: return GPIO7;
        case PD8:
        case PE8: return GPIO8;
        case PA9:
        case PD9:
        case PG9: return GPIO9;
        case PB10:
        case PA10:
        case PC10: return GPIO10;
        case PB11:
        case PC11: return GPIO11;
        case PC12: return GPIO12;
        case PG14: return GPIO14;
        default: return 0xfffffff;
    }
}

/* Return base register for each GPIO based on PIN name */
static uint32_t
pin_to_gpio(enum UART_PORT_PIN pin) {
    switch (pin) {
        case PA0:
        case PA1:
        case PA2:
        case PA3:
        case PA9:
        case PA10:
            return GPIOA;
        case PB6:
        case PB7:
        case PB10:
        case PB11:
            return GPIOB;
        case PC6:
        case PC7:
        case PC10:
        case PC11:
        case PC12:
            return GPIOC;
        case PD2:
        case PD5:
        case PD6:
        case PD8:
        case PD9:
            return GPIOD;
        case PE0:
        case PE1:
        case PE7:
        case PE8:
            return GPIOE;
        case PF6:
        case PF7:
            return GPIOF;
        case PG9:
        case PG14:
            return GPIOG;
        default: return 0xfffffff;
    }
}

/*
 * This maps a pin to its GPIO clock, since you have to enable
 * the GPIO clock for the port this takes care of that for us.
 */
static uint32_t
pin_to_enable(enum UART_PORT_PIN pin) {
    switch (pin) {
        case PA0:
        case PA1:
        case PA2:
        case PA3:
        case PA9:
        case PA10: return RCC_AHB1ENR_IOPAEN;

        case PB6:
        case PB7:
        case PB10:
        case PB11: return RCC_AHB1ENR_IOPBEN;

        case PC6:
        case PC7:
        case PC10:
        case PC11:
        case PC12: return RCC_AHB1ENR_IOPCEN;

        case PD2:
        case PD5:
        case PD6:
        case PD8:
        case PD9: return RCC_AHB1ENR_IOPDEN;

        case PE0:
        case PE1:
        case PE7:
        case PE8: return RCC_AHB1ENR_IOPEEN;

        case PF6:
        case PF7: return RCC_AHB1ENR_IOPFEN;

        case PG9:
        case PG14: return RCC_AHB1ENR_IOPGEN;
        default: return 0xfffffff;
    }
}

/*
 * A number of attributes common to each USART/UART such as
 * their ENABLE flag in the APB register, their NVIC interrupt
 * vector, their 'home' APB register (1 or 2) and their base
 * address.
 */
static uint32_t
pin_uart_attr(enum UART_PORT_PIN pin, int attr) {
    switch (pin) {
        case PA0:
        case PA1:
            switch (attr) {
                case 1: return RCC_APB1ENR_UART4EN;
                case 2: return (uint32_t) &RCC_APB1ENR;
                case 3: return NVIC_UART4_IRQ;
                default: return UART4;
            }

        case PA2:
        case PA3:
        case PD5:
        case PD6:
            switch (attr) {
                case 1: return RCC_APB1ENR_USART2EN;
                case 2: return (uint32_t) &RCC_APB1ENR;
                case 3: return NVIC_USART2_IRQ;
                default: return USART2;
            }

        case PA9:
        case PA10:
        case PB6:
        case PB7:
            switch (attr) {
                case 1: return RCC_APB2ENR_USART1EN;
                case 2: return (uint32_t) &RCC_APB2ENR;
                case 3: return NVIC_USART1_IRQ;
                default: return USART1;
            }

        case PB10:
        case PB11:
        case PC10:
        case PC11:
        case PD8:
        case PD9:
            switch (attr) {
                case 1: return RCC_APB1ENR_USART3EN;
                case 2: return (uint32_t) &RCC_APB1ENR;
                case 3: return NVIC_USART3_IRQ;
                default: return USART3;
            }

        case PC6:
        case PC7:
        case PG9:
        case PG14:
            switch (attr) {
                case 1: return RCC_APB2ENR_USART6EN;
                case 2: return (uint32_t) &RCC_APB2ENR;
                case 3: return NVIC_USART6_IRQ;
                default: return USART6;
            }

        case PC12:
        case PD2:
            switch (attr) {
                case 1: return RCC_APB1ENR_UART5EN;
                case 2: return (uint32_t) &RCC_APB1ENR;
                case 3: return NVIC_UART5_IRQ;
                default: return UART5;
            }

        case PE0:
        case PE1:
            switch (attr) {
                case 1: return RCC_APB1ENR_UART8EN;
                case 2: return (uint32_t) &RCC_APB1ENR;
                case 3: return NVIC_UART8_IRQ;
                default: return UART8;
            }

        case PE7:
        case PE8:
        case PF6:
        case PF7:
            switch (attr) {
                case 1: return RCC_APB1ENR_UART7EN;
                case 2: return (uint32_t) &RCC_APB1ENR;
                case 3: return NVIC_UART7_IRQ;
                default: return UART7;
            }

        default: return 0xfffffff;
    }
}

/* This one then maps which Alternate function flag is needed for a pin
 * to make it a UART pin
 */
static uint32_t
pin_to_af(enum UART_PORT_PIN pin) {
    switch (pin) {
        case PA0:
        case PA1:
        case PC6:
        case PC7:
        case PC12:
        case PD2:
        case PE0:
        case PE1:
        case PE7:
        case PE8:
        case PF6:
        case PF7:
        case PG9:
        case PG14:
            return GPIO_AF8;

        case PA2:
        case PA3:
        case PA9:
        case PA10:
        case PB6:
        case PB7:
        case PB10:
        case PB11:
        case PC10:
        case PC11:
        case PD5:
        case PD6:
        case PD8:
        case PD9:
            return GPIO_AF7;
        default: return 0xfffffff;
    }
}

