ChuckM/stm32f4-uart-driver/uart.c
/*
 * pin_map
 *
 * This code encodes the relationship between pins and various chip
 * registers, the USART, the AHB bus, the Alternate function code,
 * Etc. Call it with a pin and an attribute and get back an answer.
 *
 * See the UART initialization code for an example of its use.
 */
static uint32_t
uart_pin_map(enum UART_PORT_PIN pin, enum PIN_ATTRIBUTE attr) {
    switch (attr) {
        case USART:
            return pin_uart_attr(pin, 0);
        case APB_ENA:
            return pin_uart_attr(pin, 1);
        case APB_REG:
            return pin_uart_attr(pin, 2);
        case IRQ:
            return pin_uart_attr(pin, 3);
        case BIT:
            return pin_to_bit(pin);
        case GPIO_ENA:
            return pin_to_enable(pin);
        case AF:
            return pin_to_af(pin);
        default:
            return pin_to_gpio(pin);
    }
}

/*
 * Convert a number to a string in the desired
 * base.
 *
 * Assumes:
 *      - buf has enough space (up to 33 bytes for
 *        a 32 bit number in binary)
 * Verifies:
 *      - base is one of 2, 8, 10, or 16
 * Creates:
 *      - null string on error ("")
 *
 *                                d
 *                                V
 *       [ ] [6] [5] [4] [3] [2] [1] 
 *        ^
 *       buf
 *
 *       do {
 *          *b ^= *d;
 *          *d ^= *b;
 *          *b ^= *d;
 *       } while (++b < --d);
 *
 *      buf must have 33 bytes behind it, worst case!
 */
void
ntoa(uint32_t val, char *buf, int base) {
    char *d;

    d = buf;
    *d = '\000';
    d++;

    if ((base != 8) && (base != 2) && (base != 10) && (base != 16))  {
        return; // bad base parameter
    }
    if (val == 0) {
        *d = '0';
    } else {
        while (val > 0) {
            *d = ((val % base) < 10) ? (val % base) + '0' :
                                                 (val % base) + '7';
            val /= base;
            d++;
        }
        d--; // backup to the last digit stored.
    }
    /*
     * So how often do you get to use an interview question in your
     * code? 
     * At this point the string is in buf, only backwards so reverse it
     * in place.
     */
    do {
        *d ^= *buf;
        *buf ^= *d;
        *d ^= *buf;
    } while (++buf < --d);
    return;
}

/*
 * Convert a string to a number in the desired
 * 
 * Assumes:
 *      - buf has enough space (up to 33 bytes for
 *        a 32 bit number in binary)
 *      - Stops at first non-legal digit in specified
 *        base or NUL character.
 * Verifies:
 *      - base is one of 2, 8, 10, or 16 (no octal)
 * Returns:
 *      - 0 even on failure.
 */
uint32_t
aton(char *buf, int base) {
    uint32_t res;
    uint8_t digit;

    res = 0;
    if ((base != 2) && (base != 8) && (base != 10) && (base != 16)) {
        return 0;
    }
    while (*buf != '\000') {
        digit = (*buf > '9') ? (*buf - '7') : (*buf - '0');
        if (((base == 2) && (digit > 1)) ||
            ((base == 8) && (digit > 7)) ||
            ((base == 10) && (digit > 9)) ||
            ((base == 16) && (digit > 15))) {
            return res;
        }
        res *= base;
        res += digit;
        buf++;
    }
    return res;
}


/*
 * Print a number given various formatting options.
 * NB: No floating point yet. 
 *
 * This got a bit out of hand but I wanted just *one* number printing
 * function rather than several. 
 *
 * Notes from my notebook:
 * Number consists of:
 *
 *      PREFIX|NUMBER|SUFFIX
 *     |------ width -------|
 *     |------ field width -----|

 * Prefix is one of "", "-", "0x", "0b", "0", "-0x" "-0b", "-0"
 * Suffix is one of "", ".0"
 *
 * The independent variable is the leading zero question.
 * So when LEADING ZERO is set you pad the width of Number to fill
 * the width, up to 32 bits of precision.
 *
 * With LEFT adjust you pad right, without it you pad left.
 *
 * Examples:
 *   0x12345000 - hex + alternate form
 *     1234abcd - just hex 
 *           0C - hex + width of 2 + leading 0
 *         10.0 - decimal + alternate form
 *      0b11011 - Binary + alternate form
 *   0b00011011 - Binary + alternate form + leading 0 + 8 digits
 *   123        - Decimal + left adjust + width of 10
 *          010 - octal
 * 037777777777 - octal equivalent of -1
 *         -1.0 - decimal + sign + alternate form (adds the .0)
 *
 */
void
uart_putnum(int chan, uint16_t fmt, uint32_t num) {
    char buf[33];
    int width;
    char *prefix;
    char *suffix;
    char *t;
    int n_width, ps_width, pad;
    int sign_bit = 0;

    width = fmt & FMT_WIDTH_MASK;
    n_width = 0; // total number width
    ps_width = 0;
    sign_bit = 0;
    if ((fmt & FMT_SIGNED) && ((num & 0x80000000) != 0)) {
        num = -num; // force value to be postive
        sign_bit++; // remember to put the '-' on later
        ps_width++;
    }
    prefix = NULL;
    suffix = NULL;
    switch (fmt & FMT_BASE_MASK) {
        case FMT_BASE_2:
            ntoa(num, buf, 2);
            if (fmt & FMT_ALTERNATE_FORM) {
                prefix = (sign_bit) ? "-0b" : "0b";
                ps_width += 2;
            }
            break;
        case FMT_BASE_8:
            ntoa(num, buf, 8);
            if (fmt & FMT_ALTERNATE_FORM) {
                prefix = (sign_bit) ? "-0" : "0";
                ps_width++;
            }
            break;
    case FMT_BASE_16:
            ntoa(num, buf, 16);
            if (fmt & FMT_ALTERNATE_FORM) {
                prefix = (sign_bit) ? "-0x" : "0x";
                ps_width += 2;
            }
            break;
    case FMT_BASE_10:
            ntoa(num, buf, 10);
            if (fmt & FMT_ALTERNATE_FORM) {
                prefix = (sign_bit) ? "-" : "";
                suffix = ".0";
                ps_width += 2;        /* do this for decimal too since we add .0 in that case */
            }
            break;
    }
    /*
     * Look for the start of the number
     * (first non-zero, or only zero) and count from
     * there forward to get number width.
     */
    n_width = 0; // number is initially zero length;
    for (t = &buf[0]; *t != '\000'; t++) {
        n_width++;
    }
    pad = width - (n_width + ps_width); 

