ChuckM/stm32f4-uart-driver/uart.c
    /*
     * Ok, now we've got ps_width (prefix + suffix width), n_width (width of the actual number)
     * and buf has had zeros removed if necessary ?
     * Now we have three actions:
     * width is unset 
     *      - send out prefix:number:suffix
     * width is set and ZEROS is set 
     *      - subtract prefix/suffix length from width,
     *      - subtract number width from width => n_pad
     *      - print prefix, print n_pad zeros, print number, print suffix
     * width is set and ZEROs is not set
     *      - subtract prefix+suffix+number width from width
     *      - if Left adjust
     *          print prefix:num:suffix then pad spaces
     *      - else
     *          print pad spaces then prefix:num:suffix
     */
    if ((width == 0) || (pad < 0)) {
        // simple case, no width, or overflow width, just print it.
        uart_puts(chan, prefix);
        uart_puts(chan, buf);
        uart_puts(chan, suffix);
    } else {
        if (fmt & FMT_LEADING_ZERO) {
            uart_puts(chan, prefix);
            while (pad-- > 0) {
                uart_putc(chan, '0');
            }
            uart_puts(chan, buf);
            uart_puts(chan, suffix);
        } else {
            if (fmt & FMT_LEFT_ADJUST) {
                uart_puts(chan, prefix);
                uart_puts(chan, buf);
                uart_puts(chan, suffix);
                while (pad-- > 0) {
                    uart_putc(chan, ' ');
                }
            } else {
                while (pad-- > 0) {
                    uart_putc(chan, ' ');
                }
                uart_puts(chan, prefix);
                uart_puts(chan, buf);
                uart_puts(chan, suffix);
            }
        }
    }
    if (fmt & FMT_NEWLINE) {
        uart_puts(chan, "\n");
    }
}
